malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
    awaiting_response = false;
    ESP_LOGD(TAG, "at_send_cmd_internal: ret=%d cmd=%s", ret, cmd ? cmd : "NULL");
    return ret;
}

static esp_err_t at_send_cmd(const char *cmd, const char *expected_resp,
                             char *response_buf, size_t buf_size,
                             uint32_t timeout_ms) {
    if (simcom_mutex == NULL) {
        ESP_LOGE(TAG, "at_send_cmd: mutex NULL para cmd=%s", cmd ? cmd : "NULL");
        return ESP_ERR_INVALID_STATE;
    }

    ESP_LOGD(TAG, "at_send_cmd: aguardando mutex...");
    if (xSemaphoreTake(simcom_mutex, pdMS_TO_TICKS(timeout_ms + 1000)) != pdTRUE) {
        ESP_LOGE(TAG, "Falha ao obter mutex SIMCom para o comando: %s", cmd ? cmd : "NULL");
        return ESP_ERR_TIMEOUT;
    }
    ESP_LOGD(TAG, "at_send_cmd: mutex obtido, drenando sem...");

    esp_err_t ret = at_send_cmd_internal(cmd, expected_resp, response_buf, buf_size, timeout_ms);

    xSemaphoreGive(simcom_mutex);
    return ret;
}

/* --- Estado da recepcao multilinha MQTT --- */
static int mqtt_rx_state = 0;       // 0=idle, 1=waiting_topic, 2=waiting_payload
static int mqtt_rx_topic_len = 0;
static int mqtt_rx_payload_len = 0;
static char mqtt_rx_topic[128] = {0};
static int mqtt_rx_topic_idx = 0;
static char mqtt_rx_payload[1024] = {0};
static int mqtt_rx_payload_idx = 0;

static void process_simcom_line(const char *line) {
    // 1. URCs de Mensagens MQTT Recebidas (formato multilinha: +CMQTTRXSTART/TOPIC/PAYLOAD/END)
    if (strncmp(line, "+CMQTTRXSTART:", 14) == 0) {
        int client_index = 0;
        if (sscanf(line, "+CMQTTRXSTART: %d,%d,%d", &client_index, &mqtt_rx_topic_len, &mqtt_rx_payload_len) >= 3) {
            mqtt_rx_state = 1;
            mqtt_rx_topic_idx = 0;
            mqtt_rx_payload_idx = 0;
            memset(mqtt_rx_topic, 0, sizeof(mqtt_rx_topic));
            memset(mqtt_rx_payload, 0, sizeof(mqtt_rx_payload));
        }
    }
    else if (strncmp(line, "+CMQTTRXTOPIC:", 14) == 0 && mqtt_rx_state == 1) {
        int client_index = 0, sub_topic_len = 0;
        sscanf(line, "+CMQTTRXTOPIC: %d,%d", &client_index, &sub_topic_len);
        // Le bytes do topico da UART
        uint32_t start = xTaskGetTickCount();
        while (mqtt_rx_topic_idx < sub_topic_len && (xTaskGetTickCount() - start) < pdMS_TO_TICKS(2000)) {
            uint8_t c;
            if (uart_read_bytes(SIMCOM_UART_PORT, &c, 1, pdMS_TO_TICKS(50)) > 0) {
                mqtt_rx_topic[mqtt_rx_topic_idx++] = c;
            }
        }
        mqtt_rx_topic[mqtt_rx_topic_idx] = '\0';
        mqtt_rx_state = 2;
    }
    else if (strncmp(line, "+CMQTTRXPAYLOAD:", 16) == 0 && mqtt_rx_state == 2) {
        int client_index = 0, sub_payload_len = 0;
        sscanf(line, "+CMQTTRXPAYLOAD: %d,%d", &client_index, &sub_payload_len);
        // Le bytes do payload da UART
        uint32_t start = xTaskGetTickCount();
        while (mqtt_rx_payload_idx < sub_payload_len && (xTaskGetTickCount() - start) < pdMS_TO_TICKS(2000)) {
            uint8_t c;
            if (uart_read_bytes(SIMCOM_UART_PORT, &c, 1, pdMS_TO_TICKS(50)) > 0) {
                mqtt_rx_payload[mqtt_rx_payload_idx++] = c;
            }
        }
        mqtt_rx_payload[mqtt_rx_payload_idx] = '\0';
    }
    else if (strncmp(line, "+CMQTTRXEND:", 12) == 0 && mqtt_rx_state >= 1) {
        mqtt_rx_state = 0;
        ESP_LOGI(TAG, "URC MQTT RX: Topic=%s, Payload=%.*s",
                 mqtt_rx_topic, mqtt_rx_payload_idx, mqtt_rx_payload);
        // Roteia comandos e configuracoes
        if (strstr(mqtt_rx_topic, "/cmd") != NULL) {
            cmd_parser_process_message(mqtt_rx_topic, mqtt_rx_payload);
        } else if (strstr(mqtt_rx_topic, "/config") != NULL) {
            ble_mobile_process_config_json(mqtt_rx_payload);
        }
    }
    // 2. Outras URCs do MQTT Celular
    else if (strncmp(line, "+CGNSSPWR:READY!", 15) == 0) {
        gnss_ready = true;
        ESP_LOGI(TAG, "URC GNSS: Chip GNSS pronto (+CGNSSPWR:READY!).");
    }
    else if (strncmp(line, "+CMQTTCONNLOST:", 15) == 0) {
        ESP_LOGW(TAG, "URC MQTT: Conexao perdida com o broker.");
        cellular_mqtt_connected = false;
        modem_state = SIMCOM_STATE_REGISTERED;
        mqtt_rx_state = 0;
    }
    else if (strncmp(line, "+CMQTTNONET:", 12) == 0) {
        ESP_LOGW(TAG, "URC MQTT: Rede indisponivel (NONET). Desconectando...");
        cellular_mqtt_connected = false;
        modem_state = SIMCOM_STATE_REGISTERED;
        mqtt_rx_state = 0;
    }
    else if (strncmp(line, "+CMQTTCONNECT: 0,0", 18) == 0) {
        ESP_LOGI(TAG, "URC MQTT: Conectado com sucesso.");
        cellular_mqtt_connected = true;
        modem_state = SIMCOM_STATE_MQTT_CONNECTED;
    } else if (strncmp(line, "+CMQTTCONNECT:", 14) == 0) {
        int cid = 0, err_code = 0;
        if (sscanf(line, "+CMQTTCONNECT: %d,%d", &cid, &err_code) == 2) {
            if (err_code == 0) {
                cellular_mqtt_connected = true;
                modem_state = SIMCOM_STATE_MQTT_CONNECTED;
            } else {
                ESP_LOGE(TAG, "URC MQTT: Falha de conexao. Erro: %d", err_code);
                cellular_mqtt_connected = false;
                modem_state = SIMCOM_STATE_REGISTERED;
            }
        }
    }
    // 3. Resposta Normal de Comando AT
    else {
        if (awaiting_response) {
            int len = strlen(line);
            if (cmd_response_len + len + 2 < sizeof(cmd_response_buf)) {
                strcpy(cmd_response_buf + cmd_response_len, line);
                cmd_response_len += len;
                cmd_response_buf[cmd_response_len++] = '\n';
                cmd_response_buf[cmd_response_len] = '\0';
            }
            
            // Verifica fim de comando ou prompt
            if (strcmp(line, "OK") == 0 || strstr(line, "ERROR") != NULL || strcmp(line, ">") == 0) {
                xSemaphoreGive(response_sem);
            }
        }
    }
}

static void simcom_uart_rx_task(void *pvParameters) {
    char line_buf[512];
    int line_idx = 0;
    uint8_t c;

    ESP_LOGI(TAG, "Tarefa de recepcao serial SIMCom iniciada.");

    while (1) {
        int read_len = uart_read_bytes(SIMCOM_UART_PORT, &c, 1, portMAX_DELAY);
        if (read_len > 0) {
            if (c == '\n') {
                line_buf[line_idx] = '\0';
                // Remove CR
                if (line_idx > 0 && line_buf[line_idx - 1] == '\r') {
                    line_buf[line_idx - 1] = '\0';
                }
                if (strlen(line_buf) > 0) {
                    process_simcom_line(line_buf);
                }
                line_idx = 0;
            } else if (c == '>') {
                // Trata o prompt '>' de envio do SIMCom
                line_buf[line_idx++] = c;
                line_buf[line_idx] = '\0';
                process_simcom_line(">");
                line_idx = 0;
            } else {
                if (line_idx < sizeof(line_buf) - 2) {
                    line_buf[line_idx++] = c;
                } else {
                    line_buf[line_idx] = '\0';
                    process_simcom_line(line_buf);
                    line_idx = 0;
                }
            }
        }
    }
}

/* --- Metodos Auxiliares de Inicializacao e Rede --- */

static void extract_digits(const char *src, char *dst, size_t max_len) {
    size_t d_idx = 0;
    for (size_t s_idx = 0; src[s_idx] != '\0' && d_idx < max_len - 1; s_idx++) {
        if (src[s_idx] >= '0' && src[s_idx] <= '9') {
            dst[d_idx++] = src[s_idx];
        }
    }
    dst[d_idx] = '\0';
}

static esp_err_t simcom_driver_get_ccid(char *ccid_out, size_t max_len) {
    if (ccid_out == NULL || max_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    ccid_out[0] = '\0';

    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CICCID\r\n", "OK", resp, sizeof(resp), 5000);
    if (err != ESP_OK) {
        return err;
    }

    char *p = strstr(resp, "+CICCID:");
    if (p != NULL) {
        p += 8;
    } else {
        p = resp;
    }

    extract_digits(p, ccid_out, max_len);
    return ESP_OK;
}

static esp_err_t at_init_sequence(void) {
    esp_err_t err;

