malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
esp_err_t simcom_driver_mqtt_connect(const mqtt_publisher_config_t *mqtt_config) {
    if (mqtt_config == NULL) return ESP_ERR_INVALID_ARG;

    if (modem_state < SIMCOM_STATE_REGISTERED) {
        ESP_LOGE(TAG, "Modem nao registrado na rede celular.");
        return ESP_ERR_INVALID_STATE;
    }

    memcpy(&stored_mqtt_config, mqtt_config, sizeof(mqtt_publisher_config_t));
    mqtt_config_loaded = true;

    // 0. Limpa qualquer sessao MQTT anterior (se o watchdog reexecutou)
    cellular_mqtt_connected = false;
    at_send_cmd("AT+CMQTTREL=0\r\n", "OK", NULL, 0, 3000);
    at_send_cmd("AT+CMQTTSTOP\r\n", "OK", NULL, 0, 15000);
    vTaskDelay(pdMS_TO_TICKS(1000));

    // 1. Inicia o servico MQTT local no modem
    if (at_send_cmd("AT+CMQTTSTART\r\n", "OK", NULL, 0, 15000) != ESP_OK) {
        ESP_LOGE(TAG, "Erro ao iniciar servico MQTT (CMQTTSTART).");
        return ESP_FAIL;
    }

    // 2. Adquire o cliente MQTT (indice 0, ID customizado)
    char cmd[512];
    snprintf(cmd, sizeof(cmd), "AT+CMQTTACCQ=0,\"%s\"\r\n", mqtt_config->client_id);
    if (at_send_cmd(cmd, "OK", NULL, 0, 5000) != ESP_OK) {
        ESP_LOGE(TAG, "Erro ao adquirir cliente MQTT (CMQTTACCQ).");
        return ESP_FAIL;
    }

    // 3 & 4. Configura Will Topic e Will Message sob mutex
    if (xSemaphoreTake(simcom_mutex, pdMS_TO_TICKS(15000)) == pdTRUE) {
        char will_topic[128];
        snprintf(will_topic, sizeof(will_topic), "agro/bastao/%s/status", mqtt_config->username);
        snprintf(cmd, sizeof(cmd), "AT+CMQTTWILLTOPIC=0,%d\r\n", strlen(will_topic));
        if (at_send_cmd_internal(cmd, ">", NULL, 0, 5000) == ESP_OK) {
            snprintf(cmd, sizeof(cmd), "%s\r\n", will_topic);
            at_send_cmd_internal(cmd, "OK", NULL, 0, 5000);
        }

        const char *will_msg = "offline";
        snprintf(cmd, sizeof(cmd), "AT+CMQTTWILLMSG=0,%d,1\r\n", strlen(will_msg));
        if (at_send_cmd_internal(cmd, ">", NULL, 0, 5000) == ESP_OK) {
            snprintf(cmd, sizeof(cmd), "%s\r\n", will_msg);
            at_send_cmd_internal(cmd, "OK", NULL, 0, 5000);
        }
        xSemaphoreGive(simcom_mutex);
    } else {
        ESP_LOGE(TAG, "Falha ao obter mutex para configuracao de Will Topic/Msg.");
        return ESP_ERR_TIMEOUT;
    }

    // 5. Conecta ao Broker
    // O modem suporta url no formato "tcp://broker:port"
    // Remove "mqtt://" ou prefixo se houver, ou formata diretamente
    char raw_uri[128];
    strncpy(raw_uri, mqtt_config->broker_uri, sizeof(raw_uri) - 1);
    char *clean_uri = raw_uri;
    if (strncmp(clean_uri, "mqtt://", 7) == 0) {
        clean_uri += 7;
    } else if (strncmp(clean_uri, "mqtts://", 8) == 0) {
        clean_uri += 8;
    }

    snprintf(cmd, sizeof(cmd), "AT+CMQTTCONNECT=0,\"tcp://%s\",60,1,\"%s\",\"%s\"\r\n",
             clean_uri,
             mqtt_config->username[0] ? mqtt_config->username : "bastao-esp",
             mqtt_config->password[0] ? mqtt_config->password : "");
    ESP_LOGI(TAG, "Conectando ao Broker celular: tcp://%s (user=%s)...",
             clean_uri, mqtt_config->username[0] ? mqtt_config->username : "bastao-esp");
    
    // O CMQTTCONNECT pode levar ate 30s. Ele retorna OK e gera URC
    if (at_send_cmd(cmd, "OK", NULL, 0, 30000) != ESP_OK) {
        ESP_LOGE(TAG, "Falha na solicitacao de conexao MQTT celular.");
        return ESP_FAIL;
    }

    // Aguarda o URC setar a conexao por 15 segundos adicionais
    uint32_t start = xTaskGetTickCount();
    while (!cellular_mqtt_connected && (xTaskGetTickCount() - start) < pdMS_TO_TICKS(15000)) {
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    if (!cellular_mqtt_connected) {
        ESP_LOGE(TAG, "Timeout aguardando conexao MQTT URC.");
        return ESP_ERR_TIMEOUT;
    }

    // 6. Subscreve aos topicos de controle sob mutex
    if (xSemaphoreTake(simcom_mutex, pdMS_TO_TICKS(15000)) == pdTRUE) {
        // Topico de Comandos: id/MAC/cmd
        char cmd_topic[128];
        snprintf(cmd_topic, sizeof(cmd_topic), "id/%s/cmd", mqtt_config->username);
        snprintf(cmd, sizeof(cmd), "AT+CMQTTSUBTOPIC=0,%d,1\r\n", strlen(cmd_topic));
        if (at_send_cmd_internal(cmd, ">", NULL, 0, 5000) == ESP_OK) {
            snprintf(cmd, sizeof(cmd), "%s\r\n", cmd_topic);
            if (at_send_cmd_internal(cmd, "OK", NULL, 0, 5000) == ESP_OK) {
                at_send_cmd_internal("AT+CMQTTSUB=0\r\n", "OK", NULL, 0, 5000);
                ESP_LOGI(TAG, "Inscrito no topico de comando: %s", cmd_topic);
            }
        }
        xSemaphoreGive(simcom_mutex);
    } else {
        ESP_LOGE(TAG, "Falha ao obter mutex para inscricao no topico de comando.");
    }

    // Pausa para evitar erro 14 "client is busy"
    vTaskDelay(pdMS_TO_TICKS(1000));

    if (xSemaphoreTake(simcom_mutex, pdMS_TO_TICKS(15000)) == pdTRUE) {
        // Topico de Configurações: id/MAC/config
        char config_topic[128];
        snprintf(config_topic, sizeof(config_topic), "id/%s/config", mqtt_config->username);
        snprintf(cmd, sizeof(cmd), "AT+CMQTTSUBTOPIC=0,%d,1\r\n", strlen(config_topic));
        if (at_send_cmd_internal(cmd, ">", NULL, 0, 5000) == ESP_OK) {
            snprintf(cmd, sizeof(cmd), "%s\r\n", config_topic);
            if (at_send_cmd_internal(cmd, "OK", NULL, 0, 5000) == ESP_OK) {
                at_send_cmd_internal("AT+CMQTTSUB=0\r\n", "OK", NULL, 0, 5000);
                ESP_LOGI(TAG, "Inscrito no topico de configuracao: %s", config_topic);
            }
        }
        xSemaphoreGive(simcom_mutex);
    } else {
        ESP_LOGE(TAG, "Falha ao obter mutex para inscricao no topico de configuracao.");
    }

    modem_state = SIMCOM_STATE_MQTT_CONNECTED;
    return ESP_OK;
}

esp_err_t simcom_driver_mqtt_disconnect(void) {
    if (modem_state != SIMCOM_STATE_MQTT_CONNECTED) {
        return ESP_OK;
    }

    ESP_LOGI(TAG, "Encerrando conexao MQTT celular...");
    
    // Disconnect
    at_send_cmd("AT+CMQTTDISC=0,120\r\n", "OK", NULL, 0, 5000);
    // Release
    at_send_cmd("AT+CMQTTREL=0\r\n", "OK", NULL, 0, 3000);
    // Stop MQTT
    at_send_cmd("AT+CMQTTSTOP\r\n", "OK", NULL, 0, 15000);

