malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
    cellular_mqtt_connected = false;
    modem_state = SIMCOM_STATE_REGISTERED;
    return ESP_OK;
}

esp_err_t simcom_driver_mqtt_publish(const char *topic, const char *payload, uint8_t qos) {
    if (simcom_mutex == NULL) return ESP_ERR_INVALID_STATE;

    if (modem_state != SIMCOM_STATE_MQTT_CONNECTED || !cellular_mqtt_connected) {
        ESP_LOGW(TAG, "Impossivel publicar: MQTT celular desconectado.");
        return ESP_ERR_INVALID_STATE;
    }

    // Verifica se o mutex esta disponivel (nao bloqueia se ocupado)
    // Isso evita priority inversion: se mqtt_pub_task (prio 4) nao consegue mutex,
    // significa que outra task (ex: GPS/status) esta usando o modem - vamos direto para cache
    if (xSemaphoreTake(simcom_mutex, 0) != pdTRUE) {
        ESP_LOGW(TAG, "SIMCom mutex ocupado (modem em uso). Mensagem desviada para cache offline.");
        return ESP_ERR_TIMEOUT;  // calling code desvia para cache
    }

    // Cleanup: libera message ID 0 com retry
    // Com QoS 1, o message ID 0 fica ocupado ate o PUBACK chegar.
    // Se CMQTTREL falhar (erro 14 = busy, erro 19 = ja liberado),
    // tentamos novamente ate 10x a cada 300ms (~3s totais).
    for (int retry = 0; retry < 10; retry++) {
        esp_err_t rel_err = at_send_cmd_internal("AT+CMQTTREL=0\r\n", "OK", NULL, 0, 1000);
        if (rel_err == ESP_OK) break;           // message ID 0 liberado
        if (retry < 9) vTaskDelay(pdMS_TO_TICKS(300));
    }

    esp_err_t err = ESP_OK;
    char cmd[512];

    // 1. Define o tamanho do topico
    snprintf(cmd, sizeof(cmd), "AT+CMQTTTOPIC=0,%d\r\n", strlen(topic));
    err = at_send_cmd_internal(cmd, ">", NULL, 0, 5000);
    if (err != ESP_OK) {
        xSemaphoreGive(simcom_mutex);
        return err;
    }

    // Envia o topico
    snprintf(cmd, sizeof(cmd), "%s\r\n", topic);
    err = at_send_cmd_internal(cmd, "OK", NULL, 0, 5000);
    if (err != ESP_OK) {
        xSemaphoreGive(simcom_mutex);
        return err;
    }

    // 2. Define o tamanho do payload
    snprintf(cmd, sizeof(cmd), "AT+CMQTTPAYLOAD=0,%d\r\n", strlen(payload));
    err = at_send_cmd_internal(cmd, ">", NULL, 0, 5000);
    if (err != ESP_OK) {
        xSemaphoreGive(simcom_mutex);
        return err;
    }

    // Envia o payload
    int written = uart_write_bytes(SIMCOM_UART_PORT, payload, strlen(payload));
    if (written >= 0) {
        uart_write_bytes(SIMCOM_UART_PORT, "\r\n", 2);
    }

    // Aguarda o processamento pelo modem
    char resp[128];
    err = at_send_cmd_internal("", "OK", resp, sizeof(resp), 5000);
    if (err != ESP_OK) {
        xSemaphoreGive(simcom_mutex);
        return err;
    }

    // 3. Executa a publicacao
    // NOTA: Nao faz CMQTTREL apos CMQTTPUB. Com QoS 1, o modem aguarda PUBACK
    // e message ID 0 fica busy (erro 14) ate o PUBACK chegar. O cleanup
    // e feito no inicio do proximo publish (retry loop acima).
    snprintf(cmd, sizeof(cmd), "AT+CMQTTPUB=0,%d,60\r\n", qos);
    err = at_send_cmd_internal(cmd, "OK", NULL, 0, 10000);

    xSemaphoreGive(simcom_mutex);
    return err;
}

simcom_state_t simcom_driver_get_state(void) { return modem_state; }

bool simcom_driver_is_busy(void) {
    if (simcom_mutex == NULL) return false;
    if (xSemaphoreTake(simcom_mutex, 0) == pdTRUE) {
        xSemaphoreGive(simcom_mutex);
        return false;  // mutex livre
    }
    return true;  // mutex ocupado
}

int simcom_driver_get_cached_rssi(void) {
    return cached_rssi;
}

bool simcom_driver_is_connected(void) {
    return cellular_mqtt_connected && (modem_state == SIMCOM_STATE_MQTT_CONNECTED);
}

/* --- Leitura de Localizacao (GPS/GLONASS) --- */

esp_err_t simcom_driver_get_gps(simcom_gps_data_t *gps_out) {
    if (gps_out == NULL) return ESP_ERR_INVALID_ARG;
    memset(gps_out, 0, sizeof(simcom_gps_data_t));

    ESP_LOGI(TAG, "[GPS] Solicitando leitura de localizacao...");

    if (modem_state == SIMCOM_STATE_OFF || modem_state == SIMCOM_STATE_ERROR) {
        return ESP_ERR_INVALID_STATE;
    }

    // Liga se nao estiver ativo (power ja foi ligado no boot)
    if (!gps_powered_on) {
        simcom_driver_gps_power_on();
        vTaskDelay(pdMS_TO_TICKS(1000));
    }

    char gps_resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err;

    // Tenta CGPSINFO primeiro (NMEA DDMM.MMMM, resposta rapida ~200ms com fix)
    err = at_send_cmd("AT+CGPSINFO\r\n", "+CGPSINFO:", gps_resp, sizeof(gps_resp), 3000);
    if (err == ESP_OK) {
        char *data = strstr(gps_resp, "+CGPSINFO:");
        if (data != NULL) {
            data += 10;
            while (*data == ' ') data++;

            if (*data != ',' && *data != '\r' && *data != '\n') {
                double lat_raw = 0, lon_raw = 0;
                char ns = 'N', ew = 'E';
                float alt = 0, spd = 0;

                int parsed = sscanf(data, "%lf,%c,%lf,%c,%*[^,],%*[^,],%f,%f",
                                    &lat_raw, &ns, &lon_raw, &ew, &alt, &spd);

                if (parsed >= 6 && lat_raw > 0 && lon_raw > 0) {
                    int lat_deg = (int)(lat_raw / 100);
                    double lat_min = lat_raw - (lat_deg * 100);
                    gps_out->latitude = lat_deg + (lat_min / 60.0);
                    if (ns == 'S') gps_out->latitude = -gps_out->latitude;

                    int lon_deg = (int)(lon_raw / 100);
                    double lon_min = lon_raw - (lon_deg * 100);
                    gps_out->longitude = lon_deg + (lon_min / 60.0);
                    if (ew == 'W') gps_out->longitude = -gps_out->longitude;

                    gps_out->altitude = alt;
                    gps_out->speed_kmh = spd;
                    gps_out->valid = true;

                    ESP_LOGI(TAG, "[GPS] FIX OBTIDO (CGPSINFO): Lat=%.6f, Lon=%.6f, Alt=%.1fm",
                             gps_out->latitude, gps_out->longitude, gps_out->altitude);
                    return ESP_OK;
                }
            }
        }
    }

    // Fallback: tenta CGNSSINFO (so se CGPSINFO falhou, timeout curto)
    err = at_send_cmd("AT+CGNSSINFO\r\n", "+CGNSSINFO:", gps_resp, sizeof(gps_resp), 2000);
    if (err == ESP_OK) {
        char *data = strstr(gps_resp, "+CGNSSINFO:");
        if (data != NULL) {
            data += 11;
            while (*data == ' ') data++;

            if (*data != ',' && *data != '\r' && *data != '\n') {
                int fix_mode = 0;
                int gps_svs = 0, glo_svs = 0, bds_svs = 0;
                double lat_raw = 0, lon_raw = 0;
                char ns = 'N', ew = 'E';
                float alt = 0, spd = 0;

