malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
                // Formato: fix_mode,GPS_SVs,GLO_SVs,BDS_SVs,lat,N/S,lon,E/W,date,time,alt,spd,...
                int parsed = sscanf(data, "%d,%d,%d,%d,%lf,%c,%lf,%c,%*[^,],%*[^,],%f,%f",
                                    &fix_mode, &gps_svs, &glo_svs, &bds_svs,
                                    &lat_raw, &ns, &lon_raw, &ew, &alt, &spd);

                ESP_LOGI(TAG, "[GPS] CGNSSINFO parse: fix=%d sats=GPS:%d/GLO:%d/BDS:%d lat=%.4f%c lon=%.4f%c alt=%.1f",
                         fix_mode, gps_svs, glo_svs, bds_svs, lat_raw, ns, lon_raw, ew, alt);

                if (parsed >= 8 && fix_mode >= 1 && lat_raw > 0 && lon_raw > 0) {
                    int lat_deg = (int)(lat_raw / 100);
                    double lat_min = lat_raw - (lat_deg * 100);
                    gps_out->latitude = lat_deg + (lat_min / 60.0);
                    if (ns == 'S') gps_out->latitude = -gps_out->latitude;

                    int lon_deg = (int)(lon_raw / 100);
                    double lon_min = lon_raw - (lon_deg * 100);
                    gps_out->longitude = lon_deg + (lon_min / 60.0);
                    if (ew == 'W') gps_out->longitude = -gps_out->longitude;

                    gps_out->altitude = alt;
                    gps_out->speed_kmh = spd;
                    gps_out->valid = true;

                    ESP_LOGI(TAG, "[GPS] FIX OBTIDO (CGNSSINFO): Lat=%.6f, Lon=%.6f, Alt=%.1fm",
                             gps_out->latitude, gps_out->longitude, gps_out->altitude);
                    return ESP_OK;
                }
            }
        }
    }

    ESP_LOGI(TAG, "[GPS] Nenhum fix valido disponivel.");
    gps_out->valid = false;
    return ESP_ERR_NOT_FOUND;
}

esp_err_t simcom_driver_gps_power_on(void) {
    if (gps_powered_on) return ESP_OK;

    ESP_LOGI(TAG, "[GPS] Ativando receptor GNSS celular (Cold Start)...");
    gnss_ready = false;
    esp_err_t err = at_send_cmd("AT+CGNSSPWR=1\r\n", "OK", NULL, 0, 9000);
    if (err != ESP_OK) {
        err = at_send_cmd("AT+CGPS=1\r\n", "OK", NULL, 0, 9000);
    }

    if (err == ESP_OK) {
        gps_powered_on = true;
        ESP_LOGI(TAG, "[GPS] GNSS ligado com sucesso. Aguardando READY!...");
        /* Nao bloqueia aqui — gnss_ready sera setado pelo URC process_simcom_line() */
    }
    return err;
}

esp_err_t simcom_driver_gps_power_off(void) {
    if (!gps_powered_on) return ESP_OK;

    ESP_LOGI(TAG, "[GPS] Desligando receptor GNSS...");
    esp_err_t err = at_send_cmd("AT+CGNSSPWR=0\r\n", "OK", NULL, 0, 9000);
    if (err != ESP_OK) {
        err = at_send_cmd("AT+CGPS=0\r\n", "OK", NULL, 0, 9000);
    }

    if (err == ESP_OK) {
        gps_powered_on = false;
        gnss_ready = false;
        ESP_LOGI(TAG, "[GPS] GNSS desligado.");
    }
    return err;
}

esp_err_t simcom_driver_configure_gnss(void) {
    if (!gps_powered_on) {
        ESP_LOGW(TAG, "[GNSS] Nao configurado: GNSS desligado.");
        return ESP_ERR_INVALID_STATE;
    }

    ESP_LOGI(TAG, "[GNSS] Configurando constelacoes (CGNSSMODE=7: GPS+BDS+GLONASS)...");
    esp_err_t err = at_send_cmd("AT+CGNSSMODE=7\r\n", "OK", NULL, 0, 5000);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "[GNSS] Constelacoes configuradas: GPS+BDS+GLONASS.");
    } else {
        ESP_LOGW(TAG, "[GNSS] CGNSSMODE=7 falhou (modem pode nao suportar). Tentando modo 3...");
        err = at_send_cmd("AT+CGNSSMODE=3\r\n", "OK", NULL, 0, 5000);
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "[GNSS] Constelacoes configuradas: GPS+QZSS (modo limitado).");
        }
    }
    return err;
}

esp_err_t simcom_driver_download_agps(void) {
    if (!gps_powered_on) {
        ESP_LOGW(TAG, "[AGPS] GNSS desligado. Ligando primeiro...");
        esp_err_t e = simcom_driver_gps_power_on();
        if (e != ESP_OK) return e;
    }

    /* Aguarda chip GNSS pronto (URC +CGNSSPWR:READY!) — timeout 15s */
    if (!gnss_ready) {
        ESP_LOGI(TAG, "[AGPS] Aguardando chip GNSS ficar pronto (+CGNSSPWR:READY!)...");
        uint32_t start = xTaskGetTickCount();
        while (!gnss_ready && (xTaskGetTickCount() - start) < pdMS_TO_TICKS(15000)) {
            vTaskDelay(pdMS_TO_TICKS(500));
        }
        if (!gnss_ready) {
            ESP_LOGW(TAG, "[AGPS] Timeout aguardando READY! do GNSS (15s). Continuando...");
        }
    }

    /* Configura constelacoes (GPS+BDS+GLONASS para mais satelites) */
    simcom_driver_configure_gnss();

    /* Baixa dados de assistencia do servidor AGNSS via 4G */
    ESP_LOGI(TAG, "[AGPS] Baixando dados de assistencia GNSS (AT+CAGPS)...");
    char agps_resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CAGPS\r\n", "+AGPS:", agps_resp, sizeof(agps_resp), 9000);

    if (err == ESP_OK) {
        if (strstr(agps_resp, "+AGPS:success.") != NULL) {
            agps_downloaded = true;
            ESP_LOGI(TAG, "[AGPS] Dados AGNSS baixados com SUCESSO. GPS deve obter fix muito mais rapido.");
            /* Reinicia GPS com dados de assistencia (Cold Start com efeméride) */
            at_send_cmd("AT+CGPSCOLD\r\n", "OK", NULL, 0, 5000);
        } else {
            ESP_LOGW(TAG, "[AGPS] Resposta inesperada: %s", agps_resp);
        }
    } else {
        /* Analisa codigo de erro */
        int err_code = 0;
        char *p = strstr(agps_resp, "+AGPS:");
        if (p) {
            err_code = atoi(p + 6);
        }
        ESP_LOGW(TAG, "[AGPS] Falha ao baixar dados AGNSS (erro=%d, resp=%s). GPS usa cold start puro.",
                 err_code, agps_resp);
    }

    return err;
}

/* --- Metricas e Diagnosticos Cellular --- */

static esp_err_t query_cpsi_metrics(void) {
    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CPSI?\r\n", "+CPSI:", resp, sizeof(resp), 5000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CPSI:");
    if (p == NULL) return ESP_FAIL;

    p += 6;
    while (*p == ' ') p++;

    if (strncmp(p, "LTE", 3) == 0) {
        char *fields[20] = {0};
        fields[0] = p;
        int f_idx = 1;
        char *c = p;

