malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
    // Deleta o SMS para evitar encher a memoria do SIM
    char del_cmd[32];
    snprintf(del_cmd, sizeof(del_cmd), "AT+CMGD=%d\r\n", index);
    at_send_cmd(del_cmd, "OK", NULL, 0, 5000);
}

esp_err_t simcom_driver_send_sms(const char *phone_number, const char *message) {
    at_send_cmd("AT+CMGF=1\r\n", "OK", NULL, 0, 3000);

    char cmd[64];
    snprintf(cmd, sizeof(cmd), "AT+CMGS=\"%s\"\r\n", phone_number);
    
    if (at_send_cmd(cmd, ">", NULL, 0, 5000) != ESP_OK) {
        return ESP_FAIL;
    }

    // Escreve mensagem e envia Ctrl+Z (0x1A)
    uart_write_bytes(SIMCOM_UART_PORT, message, strlen(message));
    uart_write_bytes(SIMCOM_UART_PORT, "\x1a", 1);
    
    char resp[128];
    if (at_send_cmd("", "+CMGS:", resp, sizeof(resp), 15000) == ESP_OK) {
        ESP_LOGI(TAG, "SMS enviado com sucesso.");
        return ESP_OK;
    }
    
    return ESP_FAIL;
}

esp_err_t simcom_driver_check_and_process_sms(void) {
    at_send_cmd("AT+CMGF=1\r\n", "OK", NULL, 0, 3000);

    char resp[1024];
    // List unread messages
    esp_err_t err = at_send_cmd("AT+CMGL=\"REC UNREAD\"\r\n", "OK", resp, sizeof(resp), 8000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CMGL:");
    while (p != NULL) {
        int index = -1;
        char sender[32] = {0};

        if (sscanf(p, "+CMGL: %d,\"%*[^\"]\",\"%31[^\"]\"", &index, sender) >= 2) {
            char *msg_text = strchr(p, '\n');
            if (msg_text != NULL) {
                msg_text++;
                char body[128] = {0};
                int b_idx = 0;
                while (*msg_text != '\0' && b_idx < sizeof(body) - 1) {
                    if (strncmp(msg_text, "\r\n+CMGL:", 8) == 0 || strncmp(msg_text, "\r\nOK", 4) == 0) {
                        break;
                    }
                    body[b_idx++] = *msg_text++;
                }
                body[b_idx] = '\0';
                
                // Trim spaces/CR/LF
                char *trimmed = body;
                while (*trimmed == ' ' || *trimmed == '\r' || *trimmed == '\n') trimmed++;
                int len = strlen(trimmed);
                while (len > 0 && (trimmed[len - 1] == ' ' || trimmed[len - 1] == '\r' || trimmed[len - 1] == '\n')) {
                    trimmed[len - 1] = '\0';
                    len--;
                }
                
                process_sms_command(index, sender, trimmed);
            }
        }
        p = strstr(p + 6, "+CMGL:");
    }
    return ESP_OK;
}

/* --- Watchdog e Orquestracao de Conectividade --- */

static void simcom_watchdog_task(void *pvParameters) {
    ESP_LOGI(TAG, "Watchdog de conexao celular iniciado.");
    
    TickType_t connection_attempt_start = 0;
    TickType_t modem_offline_until = 0;
    bool modem_forced_off = false;
    TickType_t sim_status_tick = 0;
    int signal_fail_count = 0;
    uint32_t net_info_counter = 0;

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(10000));

        if (cellular_suspended) {
            continue;
        }

        if (modem_forced_off) {
            if (xTaskGetTickCount() < modem_offline_until) {
                continue;
            }
            ESP_LOGI(TAG, "Watchdog: Fim do repouso forcado do modem. Religando...");
            modem_forced_off = false;
            gps_powered_on = false;
            cellular_mqtt_connected = false;
            connection_attempt_start = xTaskGetTickCount();
            if (simcom_driver_init() == ESP_OK) {
                if (stored_apn.apn[0] != '\0') {
                    if (simcom_driver_configure_apn(&stored_apn) == ESP_OK) {
                        /* Re-baixa dados AGPS apos reconexao 4G */
                        simcom_driver_download_agps();
                        if (mqtt_config_loaded) {
                            simcom_driver_mqtt_connect(&stored_mqtt_config);
                        }
                    }
                }
            }
            continue;
        }

        // Conexao estavel
        if (cellular_mqtt_connected && modem_state == SIMCOM_STATE_MQTT_CONNECTED) {
            connection_attempt_start = 0;
            // Processamento periodico de SMS de contingencia
            simcom_driver_check_and_process_sms();
            continue;
        }

        // Recupera timers de tentativa de conexao
        if (connection_attempt_start == 0) {
            connection_attempt_start = xTaskGetTickCount();
        }

        TickType_t elapsed = (xTaskGetTickCount() - connection_attempt_start) * portTICK_PERIOD_MS / 1000;
        if (elapsed >= 180) { // 3 minutos sem conseguir conectar MQTT
            ESP_LOGW(TAG, "Watchdog: 180s sem conexao MQTT. Ciclo de energia forçado de 60s...");
            at_send_cmd("AT+CPOWD=1\r\n", "OK", NULL, 0, 3000);
            modem_state = SIMCOM_STATE_OFF;
            gps_powered_on = false;
            cellular_mqtt_connected = false;
            modem_forced_off = true;
            modem_offline_until = xTaskGetTickCount() + pdMS_TO_TICKS(60000);
            connection_attempt_start = 0;
            continue;
        }

        // Log de status do SIM a cada 60s
        if (xTaskGetTickCount() - sim_status_tick > pdMS_TO_TICKS(60000)) {
            sim_status_tick = xTaskGetTickCount();
            ESP_LOGI(TAG, "Watchdog Status SIM: slot=%d, presente=%d, ccid=%s",
                     bastao_current_status.active_sim_slot,
                     bastao_current_status.sim_present,
                     bastao_current_status.sim_ccid[0] ? bastao_current_status.sim_ccid : "N/A");
        }

        // Se SIM ausente, faz swap
        if (!bastao_current_status.sim_present) {
            int other = (bastao_current_status.active_sim_slot == 0) ? 1 : 0;
            ESP_LOGI(TAG, "Watchdog: SIM ausente slot %d. Trocando para slot %d...",
                     bastao_current_status.active_sim_slot, other);
            simcom_driver_select_sim(other);
            connection_attempt_start = xTaskGetTickCount();
            signal_fail_count = 0;
            continue;
        }

